<a href="https://colab.research.google.com/github/fairyroad/Tensorflow/blob/main/Air_Passengers.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
from google.colab import files
myfile=files.upload()

Saving AirPassengers.csv to AirPassengers.csv

In [3]:
df_time_series=pd.read_csv("AirPassengers.csv")
df_time_series.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121

In [4]:
df_time_series["step"]=range(len(df_time_series))
df_time_series.head()

     Month  #Passengers  step
0  1949-01          112     0
1  1949-02          118     1
2  1949-03          132     2
3  1949-04          129     3
4  1949-05          121     4

In [5]:
#누적된 합을 계산
df_time_series["cum_sum"]=df_time_series["#Passengers"].cumsum()
#누적된 값들 중 max값 계산
df_time_series["cum_max"]=df_time_series["#Passengers"].cummax()
#누적된 값들 중 min값 계산
df_time_series["cum_min"]=df_time_series["#Passengers"].cummin()
df_time_series.head()

     Month  #Passengers  step  cum_sum  cum_max  cum_min
0  1949-01          112     0      112      112      112
1  1949-02          118     1      230      118      112
2  1949-03          132     2      362      132      112
3  1949-04          129     3      491      132      112
4  1949-05          121     4      612      132      112

In [6]:
import numpy as np
temp_date=df_time_series["Month"].map(lambda x:x.split("-"))
temp_date=np.array(temp_date.values.tolist())
temp_date[:5]

array([['1949', '01'],
       ['1949', '02'],
       ['1949', '03'],
       ['1949', '04'],
       ['1949', '05']], dtype='<U4')

In [7]:
df_time_series["year"]=temp_date[:,0]
df_time_series["month"]=temp_date[:,1]
df_time_series.head()

     Month  #Passengers  step  cum_sum  cum_max  cum_min  year month
0  1949-01          112     0      112      112      112  1949    01
1  1949-02          118     1      230      118      112  1949    02
2  1949-03          132     2      362      132      112  1949    03
3  1949-04          129     3      491      132      112  1949    04
4  1949-05          121     4      612      132      112  1949    05

In [8]:
df_time_series["diff"]=df_time_series["#Passengers"].diff().fillna(0)
df_time_series[:5]

     Month  #Passengers  step  cum_sum  cum_max  cum_min  year month  diff
0  1949-01          112     0      112      112      112  1949    01   0.0
1  1949-02          118     1      230      118      112  1949    02   6.0
2  1949-03          132     2      362      132      112  1949    03  14.0
3  1949-04          129     3      491      132      112  1949    04  -3.0
4  1949-05          121     4      612      132      112  1949    05  -8.0

In [11]:
df_time_series["pct_change"]=df_time_series["#Passengers"].pct_change().fillna(0).map(lambda x:x*100).map(lambda x:"%.2f" %x)
df_time_series.head()

     Month  #Passengers  step  cum_sum  ...  year  month  diff pct_change
0  1949-01          112     0      112  ...  1949     01   0.0       0.00
1  1949-02          118     1      230  ...  1949     02   6.0       5.36
2  1949-03          132     2      362  ...  1949     03  14.0      11.86
3  1949-04          129     3      491  ...  1949     04  -3.0      -2.27
4  1949-05          121     4      612  ...  1949     05  -8.0      -6.20

[5 rows x 10 columns]

In [12]:
df_time_series.sort_values(by=["#Passengers"],axis=0)

       Month  #Passengers  step  cum_sum  ...  year  month  diff pct_change
10   1949-11          104    10     1402  ...  1949     11 -15.0     -12.61
0    1949-01          112     0      112  ...  1949     01   0.0       0.00
22   1950-11          114    22     3056  ...  1950     11 -19.0     -14.29
12   1950-01          115    12     1635  ...  1950     01  -3.0      -2.54
1    1949-02          118     1      230  ...  1949     02   6.0       5.36
..       ...          ...   ...      ...  ...   ...    ...   ...        ...
137  1960-06          535   137    37344  ...  1960     06  63.0      13.35
126  1959-07          548   126    32453  ...  1959     07  76.0      16.10
127  1959-08          559   127    33012  ...  1959     08  11.0       2.01
139  1960-08          606   139    38572  ...  1960     08 -16.0      -2.57
138  1960-07          622   138    37966  ...  1960     07  87.0      16.26

[144 rows x 10 columns]